Revit 2025 API
HardwoodFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodFinish" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum HardwoodFinishType
Public Enumeration HardwoodFinishType
public enum class HardwoodFinishType
type HardwoodFinishType
Members
Member name | Value | Description
Gloss | 0
Semigloss | 1
Satin | 2
Unfinished | 3
See Also
Reference
Autodesk.Revit.DB.Visual Namespace